In [106]:
import pandas as pd

In [107]:
data = pd.read_csv("../Data Files/ageSexZoneIncome.csv")

In [108]:
data.fillna(method='ffill', inplace=True)

In [109]:
data = data[data['AGE5P Age in Five Year Groups'] != 'Total']

In [110]:
for column in data.columns:
    print(data[column].unique())

['15-19 years' '20-24 years' '25-29 years' '35-39 years' '30-34 years'
 '40-44 years' '45-49 years' '50-54 years' '55-59 years' '60-64 years'
 '65-69 years' '70-74 years' '75-79 years' '80-84 years' '85-89 years'
 '90-94 years' '95-99 years' '100 years and over']
['Male' 'Female']
[101. 102. 103. 104. 105. 106. 107. 108. 109. 110. 111. 112. 113. 114.
 115. 116. 117. 118. 119. 120. 121. 122. 123. 124. 125. 126. 127. 128.]
['$300-$399 ($15,600-$20,799)' '$400-$499 ($20,800-$25,999)'
 '$500-$649 ($26,000-$33,799)' '$650-$799 ($33,800-$41,599)'
 '$800-$999 ($41,600-$51,999)' '$1,000-$1,249 ($52,000-$64,999)'
 '$1,250-$1,499 ($65,000-$77,999)' '$1,500-$1,749 ($78,000-$90,999)'
 '$1,750-$1,999 ($91,000-$103,999)' '$2,000-$2,999 ($104,000-$155,999)'
 '$3,000-$3,499 ($156,000-$181,999)' '$3,500 or more ($182,000 or more)']
[ 180  292  405 ... 1006  303 1505]

In [73]:
ageDict = {
    '15-19 years' : 11, 
    '20-24 years' : 10, 
    '25-29 years' : 9, 
    '35-39 years' : 8,
    '30-34 years' : 7, 
    '40-44 years' : 6, 
    '45-49 years' : 5, 
    '50-54 years' : 4,
    '55-59 years' : 3, 
    '60-64 years' : 2, 
    '65-69 years' : 1, 
    '70-74 years' : 0,
    '75-79 years' : 0, 
    '80-84 years' : 0, 
    '85-89 years' : 0, 
    '90-94 years' : 0,
    '95-99 years' : 0, 
    '100 years and over' : 0
}

sexDict = {
    'Male' : 0,
    'Female' : 1
}

incomeDict = {
    '$1,000-$1,249 ($52,000-$64,999)' : 2,
    '$1,250-$1,499 ($65,000-$77,999)' : 3,
    '$1,500-$1,749 ($78,000-$90,999)' : 3,
    '$1,750-$1,999 ($91,000-$103,999)' : 4,
    '$2,000-$2,999 ($104,000-$155,999)' : 4,
    '$3,000-$3,499 ($156,000-$181,999)' : 4,
    '$3,500 or more ($182,000 or more)' : 5, 
    '$300-$399 ($15,600-$20,799)' : 0,
    '$400-$499 ($20,800-$25,999)' : 1, 
    '$500-$649 ($26,000-$33,799)' : 1,
    '$650-$799 ($33,800-$41,599)' : 1, 
    '$800-$999 ($41,600-$51,999)' : 2
}

data["Income"] = data["INCP Total Personal Income (weekly)"].map(incomeDict)

data["Age"] = data["AGE5P Age in Five Year Groups"].map(ageDict)
data["Sex"] = data["SEXP Sex"].map(sexDict)

In [74]:
data

,AGE5P Age in Five Year Groups,SEXP Sex,SA4 (POW),INCP Total Personal Income (weekly),Freq,Income,Age,Sex
0,15-19 years,Male,101.0,"$300-$399 ($15,600-$20,799)",180,0,11,0
1,15-19 years,Male,101.0,"$400-$499 ($20,800-$25,999)",292,1,11,0
2,15-19 years,Male,101.0,"$500-$649 ($26,000-$33,799)",405,1,11,0
3,15-19 years,Male,101.0,"$650-$799 ($33,800-$41,599)",255,1,11,0
4,15-19 years,Male,101.0,"$800-$999 ($41,600-$51,999)",168,2,11,0
...,...,...,...,...,...,...,...,...
12091,100 years and over,Female,128.0,"$1,500-$1,749 ($78,000-$90,999)",0,3,0,1
12092,100 years and over,Female,128.0,"$1,750-$1,999 ($91,000-$103,999)",0,4,0,1
12093,100 years and over,Female,128.0,"$2,000-$2,999 ($104,000-$155,999)",0,4,0,1
12094,100 years and over,Female,128.0,"$3,000-$3,499 ($156,000-$181,999)",0,4,0,1
12095,100 years and over,Female,128.0,"$3,500 or more ($182,000 or more)",0,5,0,1

In [75]:
data.columns

Index(['AGE5P Age in Five Year Groups', 'SEXP Sex', 'SA4 (POW)',
       'INCP Total Personal Income (weekly)', 'Freq', 'Income', 'Age', 'Sex'],
      dtype='object')

In [76]:
data.drop(columns=["AGE5P Age in Five Year Groups", "SEXP Sex", "INCP Total Personal Income (weekly)"], inplace=True)

In [77]:
obj = data.groupby([ 'Income', 'Sex', 'Age', 'SA4 (POW)']).sum()

In [78]:
data = pd.DataFrame(obj.to_records()).sort_values(by = ['Age', 'Sex'])

In [101]:
data.to_csv("../Data Files/constraintsIncome.csv", index=False)

In [96]:
pops = pd.read_csv("../Data Files/2020_sample_file.csv")

In [97]:
pops.columns

Index(['Ind', 'Gender', 'age_range', 'Occ_code', 'Partner_status', 'Region',
       'Lodgment_method', 'PHI_Ind', 'Sw_amt', 'Alow_ben_amt', 'ETP_txbl_amt',
       'Grs_int_amt', 'Aust_govt_pnsn_allw_amt', 'Unfranked_Div_amt',
       'Frk_Div_amt', 'Dividends_franking_cr_amt', 'Net_rent_amt',
       'Gross_rent_amt', 'Other_rent_ded_amt', 'Rent_int_ded_amt',
       'Rent_cap_wks_amt', 'Net_farm_management_amt', 'Net_PP_BI_amt',
       'Net_NPP_BI_amt', 'Total_PP_BI_amt', 'Total_NPP_BI_amt',
       'Total_PP_BE_amt', 'Total_NPP_BE_amt', 'Net_CG_amt', 'Tot_CY_CG_amt',
       'Net_PT_PP_dsn', 'Net_PT_NPP_dsn', 'Taxed_othr_pnsn_amt',
       'Untaxed_othr_pnsn_amt', 'Other_foreign_inc_amt', 'Other_inc_amt',
       'Tot_IncLoss_amt', 'WRE_car_amt', 'WRE_trvl_amt', 'WRE_uniform_amt',
       'WRE_self_amt', 'WRE_other_amt', 'Div_Ded_amt', 'Intrst_Ded_amt',
       'Gift_amt', 'Non_emp_spr_amt', 'Cost_tax_affairs_amt', 'Other_Ded_amt',
       'Tot_ded_amt', 'PP_loss_claimed', 'NPP_loss_claimed',
       'Rep_frng_ben_amt', 'Asbl_forgn_source_incm_amt',
       'Net_fincl_invstmt_lss_amt', 'Rptbl_Empr_spr_cont_amt',
       'Cr_PAYG_ITI_amt', 'TFN_amts_wheld_gr_intst_amt',
       'TFN_amts_wheld_divs_amt', 'Hrs_to_prepare_BPI_cnt', 'Taxable_Income',
       'Help_debt', 'Spr_Emplr_Contr', 'Spr_Prsnl_Contr', 'Spr_Othr_Contr',
       'Spr_Ttl_Acnt_Bal'],
      dtype='object')

In [98]:
pops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299162 entries, 0 to 299161
Data columns (total 65 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Ind                          299162 non-null  int64
 1   Gender                       299162 non-null  int64
 2   age_range                    299162 non-null  int64
 3   Occ_code                     299162 non-null  int64
 4   Partner_status               299162 non-null  int64
 5   Region                       299162 non-null  int64
 6   Lodgment_method              299162 non-null  object
 7   PHI_Ind                      299162 non-null  int64
 8   Sw_amt                       299162 non-null  int64
 9   Alow_ben_amt                 299162 non-null  int64
 10  ETP_txbl_amt                 299162 non-null  int64
 11  Grs_int_amt                  299162 non-null  int64
 12  Aust_govt_pnsn_allw_amt      299162 non-null  int64
 13  Unfranked_Div_amt            299162 non-null  int64
 14  Frk_Div_amt                  299162 non-null  int64
 15  Dividends_franking_cr_amt    299162 non-null  int64
 16  Net_rent_amt                 299162 non-null  int64
 17  Gross_rent_amt               299162 non-null  int64
 18  Other_rent_ded_amt           299162 non-null  int64
 19  Rent_int_ded_amt             299162 non-null  int64
 20  Rent_cap_wks_amt             299162 non-null  int64
 21  Net_farm_management_amt      299162 non-null  int64
 22  Net_PP_BI_amt                299162 non-null  int64
 23  Net_NPP_BI_amt               299162 non-null  int64
 24  Total_PP_BI_amt              299162 non-null  int64
 25  Total_NPP_BI_amt             299162 non-null  int64
 26  Total_PP_BE_amt              299162 non-null  int64
 27  Total_NPP_BE_amt             299162 non-null  int64
 28  Net_CG_amt                   299162 non-null  int64
 29  Tot_CY_CG_amt                299162 non-null  int64
 30  Net_PT_PP_dsn                299162 non-null  int64
 31  Net_PT_NPP_dsn               299162 non-null  int64
 32  Taxed_othr_pnsn_amt          299162 non-null  int64
 33  Untaxed_othr_pnsn_amt        299162 non-null  int64
 34  Other_foreign_inc_amt        299162 non-null  int64
 35  Other_inc_amt                299162 non-null  int64
 36  Tot_IncLoss_amt              299162 non-null  int64
 37  WRE_car_amt                  299162 non-null  int64
 38  WRE_trvl_amt                 299162 non-null  int64
 39  WRE_uniform_amt              299162 non-null  int64
 40  WRE_self_amt                 299162 non-null  int64
 41  WRE_other_amt                299162 non-null  int64
 42  Div_Ded_amt                  299162 non-null  int64
 43  Intrst_Ded_amt               299162 non-null  int64
 44  Gift_amt                     299162 non-null  int64
 45  Non_emp_spr_amt              299162 non-null  int64
 46  Cost_tax_affairs_amt         299162 non-null  int64
 47  Other_Ded_amt                299162 non-null  int64
 48  Tot_ded_amt                  299162 non-null  int64
 49  PP_loss_claimed              299162 non-null  int64
 50  NPP_loss_claimed             299162 non-null  int64
 51  Rep_frng_ben_amt             299162 non-null  int64
 52  Asbl_forgn_source_incm_amt   299162 non-null  int64
 53  Net_fincl_invstmt_lss_amt    299162 non-null  int64
 54  Rptbl_Empr_spr_cont_amt      299162 non-null  int64
 55  Cr_PAYG_ITI_amt              299162 non-null  int64
 56  TFN_amts_wheld_gr_intst_amt  299162 non-null  int64
 57  TFN_amts_wheld_divs_amt      299162 non-null  int64
 58  Hrs_to_prepare_BPI_cnt       299162 non-null  int64
 59  Taxable_Income               299162 non-null  int64
 60  Help_debt                    299162 non-null  int64
 61  Spr_Emplr_Contr              299162 non-null  int64
 62  Spr_Prsnl_Contr              299162 non-null  int64
 63  Spr_Othr_Contr               299162 non-null  int64
 64  Spr_Ttl_Acnt_Bal             299162 non-null  int64
dtypes: int64(64), object(1)
memory usage: 148.4+ MB

In [99]:
pops = pops[["Ind", "Gender", "age_range", "Occ_code", "Region", "Taxable_Income"]]

In [100]:
pops

           Ind  Gender  age_range  Occ_code  Region  Taxable_Income
0       297985       0         10         7      14           64907
1       151836       1          6         4       1           56872
2       148818       0          9         3       9           24575
3       235341       1          6         0      28               0
4        46063       0          5         1       1          206698
...        ...     ...        ...       ...     ...             ...
299157  159649       0         10         9      12           76035
299158  213239       1          4         0       9           28557
299159  292115       1         11         4      14           18579
299160   78224       1          2         5       1           44533
299161  117662       0          2         2      23          772014

[299162 rows x 6 columns]

In [87]:
pops[pops["Region"].isin(data["SA4 (POW)"].unique())]

Empty DataFrame
Columns: [Ind, Gender, age_range, Occ_code, Region, Taxable_Income]
Index: []

In [1]:
def expo(k, l = 5):
    return k**l

In [2]:
expo(3, 2)

9

In [3]:
expo(3)

243